import 'package:my_app2/models/quiz_question.dart';
const questions = [
  QuizQuestion('រាជធានីប្រទេសបារាំងឈ្មោះអ្វី?', [
    'ប៉ារីស',
    'ឡុងដ៍',
    'ញូវយ៉ក',
    'ដូប្លីន',
  ]),
  QuizQuestion('រាជធានីប្រទេសអៀរឡង់ឈ្មោះអ្វី?', [
    'ដូប្លីន',
    'ឡុងដ៍',
    'ប៉ារីស',
    'ញូវយ៉ក',
  ]),
  QuizQuestion('រាជធានីប្រទេសកម្ពុជាឈ្មោះអ្វី?', [
    'ភ្នំពេញ',
    'ប៉ារីស',
    'ញូវយ៉ក',
    'ដូប្លីន',
  ]),
  QuizQuestion('តើប្រាសាទអង្គរវត្តស្ថិតនៅប្រទេសណា?', [
    'កម្ពុជា',
    'ប៉ារីស',
    'ញូវយ៉ក',
    'ដូប្លីន',
  ]),
  QuizQuestion('តើ Flutter UIs ត្រូវបានបង្កើតឡើងដោយរបៀបណា?', [
    'ដោយប្រើ XCode សម្រាប់ iOS និង Android Studio សម្រាប់កម្មវិធី Android',
    'ការតម្រៀប Widgets',
    'ការតម្រៀប Views',
    'ការតម្រៀប Components',
    'ការតម្រៀប Elements',
  ]),
];
